** Compression study
   Different compression algorithm tested for the reconstruction (using root)
    The original file size was : *2.3M*
    | algorithm  | dimension[M] | compression factor |
    |------------+--------------+--------------------|
    | ZLIB (101) |          6.1 |         0.37704918 |
    | LZMA (207) |          1.4 |          1.6428571 |
    | LZMA (208) |          1.4 |          1.6428571 |
    | LZ4  (404) |          3.3 |         0.69696970 |
    |------------+--------------+--------------------|
     #+TBLFM: $3=2.3/$2
  One of the responsable of the Geant4 hadron team emailed the following suggestions:
  - reccomended version of Geant4 is 10.5.p01, we were using 10.5 and the differences
    should not be big.
  - charge exchange is typically not used, and the one implemented is still too crude to be used
    also is typically relevant only at low energies
  - we are interested in the projectile and target difraction, typically switched off if the target 
    has more than 10 Nucleons, but our active part could make a difference.
  - Elastic scattering might also play a role, one could try to check different treatment.
    - Try out *QGSP_FTFP_BERT* to use QGS for hadron with energy larger than 25 GeV
    - Use *FTFP_BERT_TRV* to use alternative treatment
      of hadron elastic scattering
    - Rerun *FTFP_BERT* by modifying the file in geant4/source/processes/hadronic/models/parton_string/diffraction/src/
      called G4FTFParameters.cc
      - switch off completely (for all types of target nucleus) projectile diffraction and target diffraction
      - switch on (for all types of target nucleus) projectile diffraction (while leaving off target diffraction)
      - switch on target diffraction diffraction and off projectile diffraction
      - switch on both projectile diffraction and target diffraction
*** test 1
    *description:* tried different compression method to compress a sample file
    coming from visible mode 2018 full simulation of the setup.
    file used is:[[/home/deppy/BackupDisk/Analysis2018/sample/compression_test/hadron_test.d][link]]
    The original file size was : *12M*
    | algorithm  | dimension[M] | compression factor |
    |------------+--------------+--------------------|
    | gzip -9    |           4. |                 3. |
    | gzip -1    |          4.6 |          2.6086957 |
    | tar -czf   |          4.0 |                 3. |
    | tar -cvjSf |          3.3 |          3.6363636 |
    | 7za a -t7z |          3.4 |          3.5294118 |
    | xz -zk     |          3.4 |          3.5294118 |
    | bzip2 -zk  |          3.3 |          3.6363636 |<=== *FASTEST AND BEST COMPRESSION!*
    |------------+--------------+--------------------|
     #+TBLFM: $3=12/$2
